online_taxt.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8081</stringProp>
          <stringProp name="HTTPSampler.path">/test/${orderId}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="User Parameters">
            <collectionProp name="UserParameters.names">
              <stringProp name="-1207110391">orderId</stringProp>
            </collectionProp>
            <collectionProp name="UserParameters.thread_values">
              <collectionProp name="-1446980947">
                <stringProp name="-1119723398">1887735432881561603</stringProp>
              </collectionProp>
              <collectionProp name="-1446980983">
                <stringProp name="-1119723397">1887735432881561604</stringProp>
              </collectionProp>
              <collectionProp name="-1446981019">
                <stringProp name="-1119723396">1887735432881561605</stringProp>
              </collectionProp>
              <collectionProp name="-1446981055">
                <stringProp name="-1119723395">1887735432881561606</stringProp>
              </collectionProp>
              <collectionProp name="-1446981091">
                <stringProp name="-1119723394">1887735432881561607</stringProp>
              </collectionProp>
              <collectionProp name="-1446981127">
                <stringProp name="-1119723393">1887735432881561608</stringProp>
              </collectionProp>
              <collectionProp name="-1446981163">
                <stringProp name="-1119723392">1887735432881561609</stringProp>
              </collectionProp>
              <collectionProp name="2087599192">
                <stringProp name="1755923806">81887735432881561610</stringProp>
              </collectionProp>
              <collectionProp name="-1446984322">
                <stringProp name="-1119723369">1887735432881561611</stringProp>
              </collectionProp>
              <collectionProp name="-1446984358">
                <stringProp name="-1119723368">1887735432881561612</stringProp>
              </collectionProp>
            </collectionProp>
            <boolProp name="UserParameters.per_iteration">false</boolProp>
          </UserParameters>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>